       IDENTIFICATION DIVISION.
       PROGRAM-ID. ONE-DIMENSIONAL.

       DATA DIVISION.
       *> Idea was taken from COBOL tutorial.
       *> Learning how loops are working.

       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(02) VALUE 0.
       01 MONTHS VALUE "JANFEBMARAPRMAYJUNJULAUGSEPOCTNOVDEC".
       05 MONTH OCCURS 12 TIMES PIC A(3).

       PROCEDURE DIVISION.

       PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER = 13
           DISPLAY "MONTHS VALUE: " MONTH(COUNTER)
       END-PERFORM.

       STOP RUN.
